Network Design:
Question:
Switch 0:
It is the server switch with the domain name AIUB
Two vlans are there CSE (vlan 2) and EEE (vlan 4)
Trunk port f0/1, f0/2 and f0/3
Switch 2:
It’s the client switch
Range for vlan 2 is from f0/4 to f0/15 (Host -502)
Range for vlan 4 is from f0/16 to f0/24 (Host-120)
Switch 3:
It’s the client switch
Range for vlan 2 is from f0/4 to f0/15 (Host -370)
Range for vlan 4 is from f0/16 to f0/24 (Host-90)
Switch 1:
Two vlans are there IT (vlan 3) and MKT (vlan 6)
Trunk port f0/1
Range for vlan 3 is from f0/2 to f0/13 (Host-480)
Range for vlan 6 is from f0/14 to f0/24 (Host-55)
Router 0:
Ip address is 172.18.0.0/16
Default gateway should be the last ip (ip before the broadcast)
DHCP pool name is dpool2 and dpool4
Ospf autonomous no is 40
Router 1:
Ip address is 172.24.0.0/16
Default gateway should be the last ip (ip before the broadcast)
DHCP pool name is dpool3 and dpool6
Ospf autonomous no is 80
Router 2:
Network ip address for Fast Ethrenet is 192.168.10.0/28
Default gateway should be the last ip (ip before the broadcast)
DHCP pool name is svr
Ospf autonomous no is 100
Apply Nat: Nat access-list should have the same number as vlan number.

______________________
Solution
Configuration:
Switch0
Switch>en
Switch#conf t
❖ Assigning the name of VTP domain
Switch(config)#vtp domain AIUB
❖ Creating vlans and assigning names to the vlans
Switch(config)#vlan 2
Switch(config-vlan)#name CSE
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#name EEE
Switch(config-vlan)#exit
❖ Assigning trunk ports
Switch(config)#int f0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan all
Switch(config-if)#exit
Switch(config)#int f0/2
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan all
Switch(config-if)#exit
Switch(config)#int f0/3
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan all
Switch1
Switch>en
Switch#conf t
❖ Changing VTP mode
Switch(config)#vtp mode client
❖ Assigning ports to the vlans
Switch(config)#int range f0/4-f0/15
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit
Switch(config)#int range f0/16-f0/24
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 4
Switch2
Switch>en
Switch#conf t
❖ Changing VTP mode
Switch(config)#vtp mode client
❖ Assigning ports to the vlans
Switch(config)#int range f0/4-f0/15
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit
Switch(config)#int range f0/16-f0/24
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 4
Router0
Router>en
Router#conf t
❖ Applying encapsulation and assigning ip to sub-interfaces
Router(config)#int f0/0
Router(config-if)#no shut
Router(config-if)#int f0/0.2
Router(config-subif)#encapsulation dot1q 2
Router(config-subif)#ip address 172.18.3.254 255.255.252.0
Router(config)#int f0/0.4
Router(config-subif)#encapsulation dot1q 4
Router(config-subif)#ip address 172.18.4.254 255.255.255.0
Router(config-subif)#exit
❖ Creating DHCP pool
Router(config)#ip dhcp pool dpool2
Router(dhcp-config)#network 172.18.0.0 255.255.252.0
Router(dhcp-config)#default 172.18.3.254
Router(dhcp-config)#exit
Router(config)#ip dhcp pool dpool4
Router(dhcp-config)#network 172.18.4.0 255.255.255.0
Router(dhcp-config)#default 172.18.4.254
❖ Assigning ip to serial interface
Router(config)#int s0/3/0
Router(config-if)#ip address 100.0.0.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shut
Router(config-if)#exit
❖ Assigning routing protocol (OSPF with autonomous number 40)
Router(config)#router ospf 40
Router(config-router)#network 172.18.0.0 0.0.3.255 area 0
Router(config-router)#network 172.18.4.0 0.0.0.255 area 0
Router(config-router)#network 100.0.0.0 0.0.0.3 area 0
Switch3
Switch>en
Switch#conf t
❖ Creating vlans and assigning names to the vlans
Switch(config)#vlan 3
Switch(config-vlan)#name HR
Switch(config-vlan)#exit
Switch(config)#vlan 6
Switch(config-vlan)#name MKT
Switch(config-vlan)#exit
❖ Assigning trunk ports
Switch(config)#int f0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allow vlan all
Switch(config-if)#exit
❖ Assigning ports to the vlans
Switch(config)#int range f0/2-f0/13
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 3
Switch(config-if-range)#exit
Switch(config)#int range f0/14-f0/24
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 6
Router1
Router>en
Router#conf t
❖ Assigning ip to serial interface
Router(config)#int s0/3/0
Router(config-if)#ip address 100.0.0.2 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#int s0/3/1
Router(config-if)#ip address 100.0.0.5 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shut
Router(config)#int f0/0
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#int f0/0
Router(config-if)#no shut
❖ Applying encapsulation and assigning ip to sub-interfaces
Router(config-if)#int f0/0.3
Router(config-subif)#encapsulation dot1q 3
Router(config-subif)#ip address 172.24.1.254 255.255.254.0
Router(config-subif)#exit
Router(config)#int f0/0.6
Router(config-subif)#encapsulation dot1q 6
Router(config-subif)#ip address 172.24.2.62 255.255.255.192
Router(config-subif)#exit
❖ Creating DHCP pool
Router(config)#ip dhcp pool dpool3
Router(dhcp-config)#network 172.24.0.0 255.255.254.0
Router(dhcp-config)#default 172.24.1.254
Router(dhcp-config)#exit
Router(config)#ip dhcp pool dpool6
Router(dhcp-config)#network 172.24.2.0 255.255.255.192
Router(dhcp-config)#default 172.24.2.62
Router(dhcp-config)#exit
❖ Assigning routing protocol (OSPF with autonomous number 80)
Router(config)#router ospf 80
Router(config-router)#network 172.24.0.0 0.0.1.255 area 0
Router(config-router)#network 172.24.2.0 0.0.0.63 area 0
Router(config-router)#network 100.0.0.0 0.0.0.3 area 0
Router(config-router)#network 100.0.0.4 0.0.0.3 area 0
Router2
Router>en
Router#conf t
❖ Assigning ip to serial interface
Router(config)#int s0/3/0
Router(config-if)#ip address 100.0.0.5 255.255.255.252
Router(config-if)#no shut
Router(config-if)#exit
❖ Assigning ip to fast-ethernet interface
Router(config)#int f0/0
Router(config-if)#ip address 192.168.10.14 255.255.255.240
Router(config-if)#no shut
Router(config-if)#exit
❖ Creating DHCP pool
Router(config)#ip dhcp pool svr
Router(dhcp-config)#network 192.168.10.0 255.255.255.240
Router(dhcp-config)#default 192.168.10.14
Router(dhcp-config)#exit
❖ Assigning routing protocol (OSPF with autonomous number 100)
Router(config)#router ospf 100
Router(config-router)#network 100.0.0.4 0.0.0.3 area 0
Router(config-router)#network 192.168.10.0 0.0.0.15 area 0
❖ Natting in Router 0
Router(config)#access-list 2 permit 172.18.0.0 0.0.3.255
Router(config)#access-list 4 permit 172.18.4.0 0.0.0.255
Router(config)#ip nat inside source list 2 interface s0/3/0 overload
Router(config)#ip nat inside source list 4 interface s0/3/0 overload
Router(config)#int s0/3/0
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#int f0/0
Router(config-if)#ip nat inside
❖ Natting in Router 1
Router(config)#access-list 3 permit 172.24.0.0 0.0.1.255
Router(config)#access-list 6 permit 172.24.2.0 0.0.0.63
Router(config)#ip nat inside source list 3 interface s0/3/1 overload
Router(config)#ip nat inside source list 6 interface s0/3/1 overload
Router(config)#int s0/3/1
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#int f0/0
Router(config-if)#ip nat inside
❖ Natting in Router 2
Router(config)#ip nat inside source static 192.168.10.1 100.0.0.6
Router(config)#int f0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#int s0/3/0
Router(config-if)#ip nat outside